<template>
  <div class="article">
    <div>
      <div>
        <ul>
          <li v-for="message in messages" :key="message.id">
            <v-container class="textbox">
              <span class="grey-text text-darken-3">{{ message.content }}</span>
            </v-container>
          </li>
        </ul>
      </div>
    </div>

    <section class="entry">
        <header>
          <img src="https://via.placeholder.com/800x400" alt="記事タイトル">
          <h1>記事タイトル</h1>
        </header>
        <section class="entry__content">
          <p>
            こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。
          </p>
          <p>
            こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。
          </p>
          <p>
            こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。こんにちは。私達はこんなことをします。よろしくおねがいします。
          </p>
        </section>
      </section>
    </div>
</template>

<script lang="ts">
import { Component, Vue } from 'vue-property-decorator'

@Component({
  name: 'Article'
})
export default class Article extends Vue {
}
</script>

<style lang="stylus">
</style>
